import re

"""
메타문자

.  ^  $  *  +  ?  {  }  [  ]  \  |  (  )

메타문자가 아닌 해당 문자를 사용하기 위해선 escape 문자를 앞에 사용한다.
-> \.  \^  \$  \*  \+  \?  \{  \}  \[  \]  \\  \|  \(  \)


"""

#===================================================================================================

#정규표현식 객체를 이용하여 필터링
#전화번호 (000-0000-0000)
phoneNumberRegex = re.compile(r'\d\d\d-\d\d\d\d-\d\d\d\d')



#===================================================================================================


#전화번호 앞자리, 뒷자리 그룹핑
"""
#정규 표현식 객체에 괄호를 이용하여 영역 구분 가능
#-> 괄호쌍이 2개 -> 2가지 영역 구분 가능
"""
phoneNumRegex = re.compile(r'(\d\d\d)-(\d\d\d-\d\d\d\d)') 
mo = phoneNumRegex.search('My number is 415-555-4242.') 

"""
결과

>>> mo.group(1)
'415'

>>> mo.group(2) 
'555-4242'

>>> mo.group(0) 
'415-555-4242' 

>>> mo.group() 
'415-555-4242'
"""


#===================================================================================================

